u=[0 1 2 3 4]; v=[6 1 9 7 2]; 
a=[0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 
   1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 
   0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 
   0 0 0 0 1 1 1 1 0 0 0 0 0 0 0 0 
   0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 
   0 0 0 0 0 0 0 0 1 1 1 1 0 0 0 0 
   0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 
   0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 
   3 2 1 0 0 0 -1 0 0 0 0 0 0 0 0 0 
   0 0 0 0 3 2 1 0 0 0 -1 0 0 0 0 0 
   0 0 0 0 0 0 0 0 3 2 1 0 0 0 -1 0 
   6 2 0 0 0 -2 0 0 0 0 0 0 0 0 0 0 
   0 0 0 0 6 2 0 0 0 -2 0 0 0 0 0 0 
   0 0 0 0 0 0 0 0 6 2 0 0 0 -2 0 0 
   0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 
   0 0 0 0 0 0 0 0 0 0 0 0 3 2 1 0]; 

b=[6;1;1;9;9;7;7;2;0;0;0;0;0;0;0;0]; 
x=a\b

pp=csape(u,v,[1 1],[0 0]); 
pp.coefs

xq=0:.1:4; 
xx=0:.1:1; 
 
% уравнения функции для каждого отрезка 
z0=@(z)x(1)*z.^3+x(2)*z.^2+x(3)*z+x(4); 
z1=@(z)x(5)*z.^3+x(6)*z.^2+x(7)*z+x(8); 
z2=@(z)x(9)*z.^3+x(10)*z.^2+x(11)*z+x(12); 
z3=@(z)x(13)*z.^3+x(14)*z.^2+x(15)*z+x(16); 

% построить сеточную функцию и графики кубической сплайн-интерполяции 
figure(1) 
plot(xq,ppval(pp,xq),u,v,'or'), grid on 

% построить сеточную функцию и графики кусочно-кубической интерполяции 
figure(2) 
plot(xx, z0(xx), xx+1, z1(xx), xx+2, z2(xx), xx+3, z3(xx), u,v,'or'), grid,  
