u=[0 1 2 3 4]; v=[6 1 9 7 2]; % сетка функции x и y  

% формировать систем уравнении в векторно-матричной форме 
a=[0 1 0 0 0 0 0 0 
   1 1 0 0 0 0 0 0 
   0 0 0 1 0 0 0 0 
   0 0 1 1 0 0 0 0 
   0 0 0 0 0 1 0 0 
   0 0 0 0 1 1 0 0 
   0 0 0 0 0 0 0 1 
   0 0 0 0 0 0 1 1]; 

b=[6;1;1;9;9;7;7;2]; 
x=a\b; % решение системы 
xx=0:.1:1; 

%  уравнения функции для каждого отрезка 
z0=@(z)x(1)*z+x(2); 
z1=@(z)x(3)*z+x(4); 
z2=@(z)x(5)*z+x(6); 
z3=@(z)x(7)*z+x(8); 

% построить сеточную функцию и графики кусочно-линейной интерполяции 
plot(xx, z0(xx), xx+1, z1(xx), xx+2, z2(xx), xx+3, z3(xx), u,v,'or'), grid, legend('a0 x+b0', 'a1 x+b1', 'a2 x+b2', 'a3 x+b3') 
