u=[0 1 2 3 4]; v=[6 1 9 7 2]; 
a=[0 0 1 0 0 0 0 0 0 0 0 0 
   1 1 1 0 0 0 0 0 0 0 0 0 
   0 0 0 0 0 1 0 0 0 0 0 0 
   0 0 0 1 1 1 0 0 0 0 0 0 
   0 0 0 0 0 0 0 0 1 0 0 0 
   0 0 0 0 0 0 1 1 1 0 0 0 
   0 0 0 0 0 0 0 0 0 0 0 1 
   0 0 0 0 0 0 0 0 0 1 1 1 
   2 1 0 0 -1 0 0 0 0 0 0 0 
   0 0 0 2 1 0 0 -1 0 0 0 0 
   0 0 0 0 0 0 2 1 0 0 -1 0 
   0 0 0 0 0 0 0 0 0 2 1 0]; 
b=[6;1;1;9;9;7;7;2;0;0;0;0]; 

x=a\b; 
xx=0:.1:1; 

% уравнения функции для каждого отрезка 
z0=@(z)x(1)*z.^2+x(2)*z+x(3); 
z1=@(z)x(4)*z.^2+x(5)*z+x(6); 
z2=@(z)x(7)*z.^2+x(8)*z+x(9); 
z3=@(z)x(10)*z.^2+x(11)*z+x(12); 

% построить сеточную функцию и графики кусочно-кубической интерполяции 
plot(xx, z0(xx), xx+1, z1(xx), xx+2, z2(xx), xx+3, z3(xx), u,v,'or'), grid,  
legend('a0 x^2+b0x+c0', 'a1 x^2+b1x+c1', 'a2 x^2+b2x+c2', 'a3 x^2+b3x+c3')
